Autodesk.Revit.DB.PresentationTypeInternal
Since:
2021
An enumerated type which specifies options for the drawing order of a GRep.
Since:
2021

Autodesk.Revit.DB.PresentationTypeInternal.DefinedByGrep
The drawing order is determined by the GRep's object type.

Autodesk.Revit.DB.PresentationTypeInternal.Detail
The GRep draws on top of model elements and under annotations.

Autodesk.Revit.DB.PresentationTypeInternal.Default
The drawing order is determined by the GRep's object type.